Repository: Oprea-Mihai/AlumniNetMobileApp
Catalog: AlumniNetMobile/AlumniNetMobile/AlumniNetMobile/Resx/AppResource.*.resx
Languages: ro

source: About
ro: Despre

source: Accept
ro: Acceptati

# AddDescription
source: Add a description
ro: Adaugati o descriere

source: Alumni events
ro: Evenimente Alumni

source: Cancel
ro: Anulati

# CompanyNamePlaceholder
source: Company name
ro: Numele companiei

source: Create post
ro: Adaugati postarea

# Delete
source: Stergeti
ro: Delete

# DeleteFinishedStudy
source: Delete this finished study?
ro: Stergeti facultatea absolvita?

# DeleteJob
source: Delete this job?
ro: Stergeti jobul?

source: Don't have an account ? Sign up
ro: Nu aveti un cont? Creati unul

# Experience
source: Work experience
ro: Experienta

source: Faculty name
ro: Numele facultatii

source: Faculty not found
ro: Facultatea nu a fost gasita

source: Finished studies
ro: Specializari absolvite

source: Graduation year
ro: Anul absolvirii

# JobEndYear
source: Ending year
ro: Anul incetarii

# JobStartYear
source: Starting year
ro: Anul inceperii

# JobTitlePlaceholder
source: Job title
ro: Numele postului

source: Reject
ro: Refuzati

source: Remove
ro: Stergeti

source: Remove picture
ro: Stergeti imaginea

source: Save
ro: Salvati

source: Select language
ro: Selectati limba

# SelectLearningSchedule
source: Select the education form
ro: Selectati un tip de invatamant

# SelectOption
source: Select an option
ro: Alegeti o optiune

# SelectPicture
source: Select a picture
ro: Alegeti o imagine

# SelectStudyProgram
source: Select a study program
ro: Selectati un program de studii

source: Send recovery email
ro: Trimite email pentru recuperare

source: Specialization
ro: Specializarea

source: Specialization not found
ro: Specializarea nu a fost gasita

source: Still employed
ro: Inca angajat

source: Update
ro: Schimbati

source: Your preferences
ro: Preferințele tale
